Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/WBZ451/include/instance/sercom1.h
/**
 * \brief Instance header file for WBZ451
 *
 * Copyright (c) 2021 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2021-01-20T19:13:34Z */
#ifndef _BZ45_SERCOM1_INSTANCE_
#define _BZ45_SERCOM1_INSTANCE_


/* ========== Instance Parameter definitions for SERCOM1 peripheral ========== */
#define SERCOM1_CLK_REDUCTION                    _UL_(1)    
#define SERCOM1_DLY_COMPENSATION                 _UL_(1)    
#define SERCOM1_DMA                              _UL_(1)    
#define SERCOM1_DMAC_ID_RX                       _UL_(6)    
#define SERCOM1_DMAC_ID_TX                       _UL_(7)    
#define SERCOM1_FIFO_DEPTH_POWER                 _UL_(1)    
#define SERCOM1_GCLK_ID_CORE                     _UL_(3)    
#define SERCOM1_INT_MSB                          _UL_(6)    
#define SERCOM1_PMSB                             _UL_(3)    
#define SERCOM1_RETENTION_SUPPORT                _UL_(0)    
#define SERCOM1_SE_CNT                           _UL_(1)    
#define SERCOM1_SPI                              _UL_(1)    
#define SERCOM1_SPI_HW_SS_CTRL                   _UL_(1)    
#define SERCOM1_SPI_ICSPACE_EXT                  _UL_(1)    
#define SERCOM1_SPI_OZMO                         _UL_(0)    
#define SERCOM1_SPI_WAKE_ON_SSL                  _UL_(1)    
#define SERCOM1_TTBIT_EXTENSION                  _UL_(1)    
#define SERCOM1_TWIM                             _UL_(1)    
#define SERCOM1_TWIS                             _UL_(1)    
#define SERCOM1_TWIS_AUTO_ACK                    _UL_(1)    
#define SERCOM1_TWIS_GROUP_CMD                   _UL_(1)    
#define SERCOM1_TWIS_SDASETUP_CNT_SIZE           _UL_(8)    
#define SERCOM1_TWIS_SDASETUP_SIZE               _UL_(4)    
#define SERCOM1_TWIS_SUDAT                       _UL_(1)    
#define SERCOM1_TWI_FASTMP                       _UL_(1)    
#define SERCOM1_TWI_HSMODE                       _UL_(1)    
#define SERCOM1_TWI_SCLSM_MODE                   _UL_(1)    
#define SERCOM1_TWI_SMB_TIMEOUTS                 _UL_(1)    
#define SERCOM1_TWI_TENBIT_ADR                   _UL_(1)    
#define SERCOM1_USART                            _UL_(1)    
#define SERCOM1_USART_AUTOBAUD                   _UL_(1)    
#define SERCOM1_USART_COLDET                     _UL_(1)    
#define SERCOM1_USART_FLOW_CTRL                  _UL_(1)    
#define SERCOM1_USART_FRAC_BAUD                  _UL_(1)    
#define SERCOM1_USART_IRDA                       _UL_(1)    
#define SERCOM1_USART_ISO7816                    _UL_(1)    
#define SERCOM1_USART_LIN_MASTER                 _UL_(1)    
#define SERCOM1_USART_RS485                      _UL_(1)    
#define SERCOM1_USART_SAMPA_EXT                  _UL_(1)    
#define SERCOM1_USART_SAMPR_EXT                  _UL_(1)    
#define SERCOM1_INSTANCE_ID                      _UL_(4)    

#endif /* _BZ45_SERCOM1_INSTANCE_ */
